{
  "listingDate":"2021-11-18",
  "requirements":"Inventory Control, Database Management",
  "pay":18,
  "listingType":"DEMO_SOURCE",
  "applicationReq":"DemoApplicationRequirements",
  "description":"KANDL ARTISTIQUE\n\nWant to work with a product you love? KANDL ARTISTIQUE is seeking individuals who are passionate about home décor and fragrance, while creating the ultimate KANDL experience. We are an energetic, innovative and an engaged team, who values our people and their development. Not to mention, we offer employee discounts on our amazing products and a brand-new concept to the candle market.\n\nWe characterize our team as a band of avid brand enthusiasts who care deeply about our products, and work hard to achieve the best possible results. This position is perfect for someone who enjoys an organization that moves swiftly, and for someone who really cares about providing and demonstrating exceptional guest-service – and can correlate the behaviour with driving sales.\n\nWe are looking for an Inventory Associate who will be monitoring and maintaining current inventory levels.\n\nResponsibilities:\n\nAssess inventory output on a daily, weekly, or monthly basis to identify trends in productivity\nManage cycle counts of product inventories on a regular basis\nPlace and receive orders in a timely and accurate manner\nOrganize and maintain warehouse products\nAssist with packaging and shipments\nCoordinate and prepare products to facilitate labs\nKnowledge, Skills and Abilities Required\n\nKnowledge of supplies, equipment, and/or services ordering and inventory control.\nAbility to reconcile stock counts to report data.\nDatabase management skills.\nAbility to receive, stock, and/or deliver goods.\nClerical, word processing, and/or office skills.\nWorking Conditions and Physical Effort\n\nMay require handling of objects that can weigh up to 50 lbs.\nJob Types: Full-time, Part-time, Permanent\n\nSalary: $18.00-$20.00 per hour\n\nSchedule:\n\nMonday to Friday\nWeekend availability\nExperience:\n\nInventory control: 1 year (preferred)\nRetail: 1 year (preferred)\nWork remotely:\n\nNo",
  "title":"Inventory Associciate, Kandl- Artistique",
  "uuid":null,
  "qualifications":"Excel, Word, Microsoft Office",
  "demoSourceID":null,
  "location":"Toronto",
  "crossPlatformDuplicates":[],
  "jobType":"FULL_TIME",
  "jobField": "Inventory"
}