{
  "listingDate":"2021-11-16",
  "requirements":"Customer Service, ",
  "pay":0,
  "listingType":"DEMO_SOURCE",
  "applicationReq":"DemoApplicationRequirements",
  "description":"Zara offers the latest fashion trends for women, men and children. An international brand with stores in the main cities of the world and online. Our business model is centered in our customers, constantly adapting to their needs. We love what we do. Teamwork, passion, curiosity, diversity, sustainability, creativity and humility are our daily motivation. Does it sound like you? Maybe you are a Zara person.\n\nHow we imagine you\n\nYou are passionate, curious, motivated and dynamic, with something different to contribute? You are a multitasker, creative, unstoppable and proactive? Do you love fashion and celebrate self-expression? You will shine in a fast-paced environment, where you can be yourself around talented people like you! Having previous retail experience is a plus, but what we care most about is that you want to learn and grow with us. At Zara you will find more than a job.\n\nWhat we expect from you\n\nFrom day one you will belong to a team in which each voice counts. You will develop your skills and be given responsibilities. You will have all the tools at your fingertips to make a difference. As a Sales Assistant, part of your responsibilities will be:\n\nDeliver a high level of customer service\nSupport the cash desk and delivery teams\nUnderstand and be passionate about the latest fashion trends\nReplenish the shop floor\nAdhere to all the Health & Safety procedures\nSupport other store functions when needed\nFlexible availabilities (day, evening, weekend and holiday)\nWhat we offer\nIn addition to a competitive salary, you will also be entitled to an employee discount to buy the latest trends in any of our brands, Zara, Massimo Dutti and ZaraHome.\n\nOur internal talent is our greatest asset and we are proud of offering internal promotion programs where you will find opportunities to grow, eLearning and training programs- we never stop learning!, Social projects to get involved and contribute to a better society, and much more!\n\nZara Canada provides equal access to employment and will offer reasonable accommodations upon request, for job applicants with disabilities during its recruitment process.\n\nJob Types: Full-time, Part-time",
  "title":"Sales Associate, Zara Toronto",
  "uuid":null,
  "qualifications":"Demo",
  "demoSourceID":null,
  "location":"Toronto",
  "crossPlatformDuplicates":[],
  "jobType":"FULL_TIME",
  "jobField": "service"
}