{"listingDate":"2021-10-29","requirements":"Fluent english and French. COVID-19 Vaccination. ","pay":28,"listingType":"DEMO_SOURCE","applicationReq":"DemoApplicationRequirements","description":"Description\n\nHave you ever dreamt of traveling the world? Of being part of an industry-leading team that is striving to reach new heights? Of graciously welcoming and hosting over 40 million customers annually as they embark on memorable, and life-changing travels? Of proudly representing Canada on the world stage?\nWe are welcoming new Flight Attendants who will help elevate us from the #1 airline in North-America to a top-10 Global Airline in all that we do. You will be the face and personality of Air Canada, helping us shape the next chapter of our 80-year story.\nWe’re proud to share the qualities that make Canada great with our customers: empathy and warmth delivered with care and class. We are seeking talented, caring individuals ready to be ambassadors for Canada and Air Canada every time we fly.\nEvery trip our customers take is special, and that starts and ends with attracting the best people to our team. We are growing with permanent and temporary positions open at two of our bases: Toronto and Montreal\nIt’s important to know that:\nEvery trip is important. Air Canada Flight Attendants offer the care and class that Canadian hosts are renowned for.\nAir travel can be stressful, and we can help. Air Canada Flight Attendants put themselves in our customers’ shoes, treating them with warmth, graciousness and dignity, offering them the most elevated and comfortable flying experience possible.\nAir Canada Flight Attendants are ambassadors of Canada. As Canada’s flag bearing carrier, we’re proud to share our unique Canadian persona with the world and offer an experience as unique as our country.\nQualifications\n\nWe’re looking for Canadians who are:\nSafety-minded first as an essential part of customer service excellence\nNaturally empathetic\nExude a warm and caring demeanor\nWelcome all as a gracious host\nPassionate about service excellence\nProudly represent Canada at home and around the world\nTreat others with mutual respect\nListen well and is solution-oriented\nConfident in speaking publicly\nPoised\nRespectful of the importance of the rules and regulations in our industry and at Air Canada\nPrepared to wear our uniform perfectly with pride including impeccable personal grooming\nAt least 18 years of age.\nHolding a valid Canadian Passport that allows travel to all countries served by Air Canada.\nAvailable during irregular working hours (mornings, evenings, weekends and statutory holidays) as a highly flexible work schedule is part of the job,\nHealthy; Air Canada medical standards must be met in order to qualify for the role.\nConditions of employment:\nWe are committed to ensuring our Flight Attendants receive the best training possible. You will participate in our 7-week, full-time, Air Canada Flight Attendant training program based Toronto, Montreal or Vancouver.\nYou are willing to relocate to one of our Canadian bases in Montreal or Toronto.\nAs a certified Flight Attendant, the salary is $28.28/hour. Please note that training will be paid at a lower rate.\nTo ensure that you have the security clearance required by Transport Canada, we will undertake a criminal background check on all candidates.\nFlight Attendants conduct safety-critical work and as such, Air Canada medical standards must be met in order to qualify for the role. Candidates will be subject to a medical evaluation, including a drug and alcohol test and are expected to be free of any intoxicating substances.\nMandatory Covid-19 Vaccination Required as of October 31st, 2021\nCandidates must be eligible to work in the country of interest, at the time any offer of employment is made and seeking any required work permits/visas or other authorizations which may be required is the sole responsibly of the candidates applying for this position.\nLanguage Skills:\nAs Canada’s flag carrier, we’re proud to offer bilingual services. Candidates who speak both English and French fluently are preferred. As Canada’s most international airline, we would love to know if you can speak one or more of the following languages in addition to English: French, Japanese, Korean, Cantonese, Mandarin, Spanish, Italian, German, Arabic, Hebrew, Portuguese, Greek, Danish, Dutch, Hindi, Punjabi and Turkish.\nDiversity and Inclusion\nAir Canada is strongly committed to Diversity and Inclusion and aims to create a healthy, accessible and rewarding work environment which highlights employees’ unique contributions to our company’s success.\nAs an equal opportunity employer, we welcome applications from all to help us build a diverse workforce which reflects the diversity of our customers, and communities, in which we live and serve.","jobField":"Inventory","title":"Flight Attendants \"In Anticipation of\" - Air Canada","uuid":"3308a8fc-3918-493e-b227-9452bd7063e4","qualifications":"","demoSourceID":"-817835589","location":"Toronto","crossPlatformDuplicates":[],"jobType":"FULL_TIME"}